{
  "meta": {
    "run_id": "dream-100541-10d5e81a",
    "idea_id": "evp_analyzer_001",
    "idea_name": "EVP Analyzer Pro",
    "idea_dir": "01_evpanalyzerpro__evp_analyzer_001",
    "source_root": "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/",
    "input_stage_paths": [
      "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/stages/stage04.json",
      "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/stages/stage03.json",
      "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/stages/stage02.json",
      "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/meta/idea.json",
      "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/meta/boundary.json"
    ],
    "boundary_path": "runs/2026-01-08/dream-100541-10d5e81a/ideas/01_evpanalyzerpro__evp_analyzer_001/meta/boundary.json"
  },
  "technical_architecture": {
    "technology_stack": {
      "framework": "React Native + Expo",
      "language": "TypeScript",
      "navigation": "Expo Router",
      "state_management": "Zustand with React Context for global state management. Selected for simplicity over Redux while providing professional debugging and middleware support for audio processing state.",
      "storage": "SQLite via Expo SQLite for session metadata and Expo FileSystem for audio file management. AsyncStorage for app preferences. Professional audio data requires structured database with file references.",
      "authentication": "Guest-first with optional RevenueCat customer identification. No social auth required for core functionality, maintaining professional anonymity for investigators.",
      "monetization_sdk": "RevenueCat"
    },
    "app_architecture": {
      "folder_structure": "Feature-based organization: src/features/recording, src/features/analysis, src/features/sessions, src/shared/components, src/shared/services, src/shared/hooks. Audio processing isolated in src/audio module with TypeScript interfaces.",
      "component_organization": "Atomic design pattern with base components, composed features, and screen containers. Audio-specific components (Waveform, AnalysisView) in dedicated module with reusable visualization components.",
      "data_flow": "Unidirectional data flow with Zustand stores for audio session state, analysis results, and subscription status. Audio processing uses worker threads where possible to maintain UI responsiveness during analysis.",
      "error_handling": "Comprehensive error boundaries with audio-specific error recovery. Network failures handled with offline queues. Audio processing errors surfaced with user-friendly messages and automatic retry mechanisms."
    },
    "external_services": {
      "analytics": "Firebase Analytics with minimal data collection focusing on feature usage, session completion rates, and subscription conversion metrics. No personal audio data transmitted.",
      "crash_reporting": "Firebase Crashlytics for production crash monitoring with audio processing crash detection and recovery. Sensitive audio session data excluded from crash reports.",
      "push_notifications": "Not required for MVP. Offline-first design eliminates need for real-time notifications. Future consideration for analysis completion alerts in background processing.",
      "backend_services": "Client-only architecture with RevenueCat for subscription management. Optional future cloud sync via Firebase Storage for premium users with end-to-end encryption."
    },
    "security_privacy": {
      "data_encryption": "Audio files encrypted at rest using Expo Crypto for sensitive investigation data. AES-256 encryption for audio files with device keychain key management. Session metadata encrypted in SQLite database.",
      "secure_storage": "Expo SecureStore for RevenueCat API keys and encryption keys. Audio files stored in app document directory with filesystem encryption. No audio data transmitted to external services without explicit user consent.",
      "api_security": "HTTPS for all external communications (RevenueCat, Firebase). API keys stored in environment variables and Expo SecureStore. No custom API endpoints required for MVP architecture.",
      "privacy_compliance": "Data minimization with local-first architecture. GDPR compliance through data export and deletion. Clear privacy policy for analytics and subscription data. User control over cloud sync and data sharing."
    }
  },
  "standards_compliance": {
    "subscription_store_compliance": "RevenueCat SDK integration with react-native-purchases v6.0+ for complete subscription lifecycle management. Entitlement-based feature gating with proper restoration flows. Subscription state cached offline for field investigations.",
    "accessibility_design": "VoiceOver/TalkBack support for audio interfaces with semantic labels. Dynamic Type scaling for all text. High contrast mode support for waveform visualization. Alternative audio feedback for visual audio analysis elements.",
    "privacy_analytics": "Firebase Analytics with anonymized usage tracking. No audio content transmitted. Privacy Policy covers data collection, storage, and user rights. GDPR-compliant data handling with user control over analytics.",
    "testing_release_readiness": "Jest unit tests for audio processing algorithms. Detox E2E tests for critical user flows. Audio recording testing on multiple device types. Subscription sandbox testing. Performance testing for sustained audio processing."
  }
}